// Authentic Initial Data from Higher Institute of Engineering and Technology (HIET)

export const INITIAL_OBSERVERS = [
  {
    "name": "د. جرجس سيدهم",
    "days": "السبت,الثلاثاء,الأربعاء",
    "specialization": "عمارة",
    "id": "1776636227290",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "أ.د. طارق أبوعوف",
    "days": "الثلاثاء,الأربعاء",
    "specialization": "عمارة",
    "id": "1776636249757",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. محمد عساسة",
    "specialization": "عمارة",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "id": "1776636271131",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. مروة الأدهم",
    "days": "السبت,الأحد",
    "specialization": "عمارة",
    "id": "1776636346780",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "أ.م.د. محمد إسماعيل",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "specialization": "مدني",
    "id": "1776636389231",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. إيمان عبد النبي أنور",
    "specialization": "اتصالات",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "id": "1776636672561",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. محمد عبد الرحمن",
    "specialization": "اتصالات",
    "days": "",
    "id": "1776636793999",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. أحمد البسيوني",
    "days": "",
    "specialization": "مدني",
    "id": "1776636868891",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. عفاف البنا",
    "days": "",
    "specialization": "علوم أساسية",
    "id": "1776636911877",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "م. غدير طارق البيومي",
    "specialization": "علوم أساسية",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "id": "1776637220129",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. خلود عادل حسن",
    "specialization": "علوم أساسية",
    "days": "الأحد,الثلاثاء",
    "id": "1776637231123",
    "job": "هيئة معاونة"
  },
  {
    "name": "م.م. فاطمة الزهراء المتولى",
    "specialization": "علوم أساسية",
    "days": "الأحد,الثلاثاء,الأربعاء",
    "id": "1776637240759",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. نورا عاطف الحنفي",
    "specialization": "علوم أساسية",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "id": "1776637251068",
    "job": "هيئة معاونة"
  },
  {
    "name": "د. بيان حامد محمود",
    "specialization": "علوم أساسية",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "id": "1776637302898",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "م.م. أحمد محمد الباز",
    "specialization": "مدني",
    "days": "السبت,الأحد",
    "id": "1776637380939",
    "job": "هيئة معاونة"
  },
  {
    "name": "م.م. مصطفى محمد قشطة",
    "specialization": "مدني",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "id": "1776637393716",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. أميرة السيد محمد",
    "specialization": "مدني",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "id": "1776637417117",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. نورهان طارق كامل",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "specialization": "مدني",
    "id": "1776637424423",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. ندى التميمي موسى",
    "days": "",
    "specialization": "مدني",
    "id": "1776637436447",
    "job": "هيئة معاونة"
  },
  {
    "name": "م.م. رانا محسن مختار",
    "specialization": "اتصالات",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "id": "1776637536667",
    "job": "هيئة معاونة"
  },
  {
    "name": "م.م. رنا محمد البلقا",
    "specialization": "حاسبات",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "id": "1776637548298",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. سارة مجدي مختار",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "specialization": "اتصالات",
    "id": "1776637570322",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. شيماء أحمد محمد",
    "specialization": "حاسبات",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "id": "1776637578968",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. مادلين محمد الهنداوى",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "specialization": "حاسبات",
    "id": "1776637589794",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. أمل ياسر شوقى",
    "specialization": "حاسبات",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "id": "1776637598412",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. آية إبراهيم حسان",
    "specialization": "اتصالات",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "id": "1776637607718",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. اروى أحمد رضا",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "specialization": "اتصالات",
    "id": "1776637620621",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. أسماء الشرباصى",
    "specialization": "اتصالات",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "id": "1776637630758",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. هويدا على النقيب",
    "specialization": "عمارة",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "id": "1776637709956",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. سمية محمد أبو الغيط",
    "days": "",
    "specialization": "عمارة",
    "id": "1776637724763",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. رهف إبراهيم الدسوقي",
    "days": "",
    "specialization": "عمارة",
    "id": "1776637732470",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. جيرمين منصور قنديل",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "specialization": "عمارة",
    "id": "1776637789022",
    "job": "هيئة معاونة"
  },
  {
    "name": "م.م. دينا محمد رزق",
    "days": "السبت,الأحد,الثلاثاء,الأربعاء",
    "specialization": "عمارة",
    "id": "1776637809185",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. سارة ياسر محمد",
    "specialization": "عمارة",
    "days": "الثلاثاء,الأربعاء",
    "id": "1776637829683",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. هند السيد العربي",
    "days": "الأحد,الأربعاء",
    "specialization": "عمارة",
    "id": "1776637842576",
    "job": "هيئة معاونة"
  },
  {
    "name": "د. لمياء جمال العدل",
    "days": "",
    "specialization": "عمارة",
    "id": "1777974434703",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. علاء الدين السيد مرجان",
    "specialization": "عمارة",
    "days": "",
    "id": "1777974457628",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. سولافا عباس الهتيمي",
    "specialization": "عمارة",
    "days": "",
    "id": "1777974479954",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "أ.د. محمد يسرى الشيخ",
    "specialization": "مدني",
    "days": "",
    "id": "1778094249874",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. أحمد جمال",
    "days": "",
    "specialization": "مدني",
    "id": "1778094912033",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "أ.م.د. باسم أوسامي راجح",
    "days": "",
    "specialization": "مدني",
    "id": "1778247857861",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. سماح الكفافي",
    "days": "",
    "specialization": "مدني",
    "id": "1778247900446",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. أشرف شحاته",
    "specialization": "مدني",
    "days": "",
    "id": "1778247966285",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. محمود الجندي",
    "specialization": "مدني",
    "days": "",
    "id": "1778248151209",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. وليد عمر",
    "specialization": "مدني",
    "days": "",
    "id": "1778249585827",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "أ.م.د. ضياء العدل",
    "specialization": "مدني",
    "days": "",
    "id": "1778249746136",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "أ.م.د. ياسين السيد",
    "days": "",
    "specialization": "علوم أساسية",
    "id": "1778481035828",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. حياه سامي على احمد",
    "specialization": "علوم أساسية",
    "days": "",
    "id": "1778481064128",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. حمودة أبو الدهب",
    "days": "",
    "specialization": "علوم أساسية",
    "id": "1778481188370",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "أ.م.د. علي سمير عوض",
    "specialization": "علوم أساسية",
    "days": "",
    "id": "1778481206780",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. رضا سلامة",
    "days": "",
    "specialization": "علوم أساسية",
    "id": "1778481218964",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "م. أسماء علاء حسانين",
    "specialization": "عمارة",
    "days": "السبت,الثلاثاء",
    "id": "1778579296549",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. مريم رضا سابق",
    "specialization": "علوم أساسية",
    "days": "السبت,الأربعاء",
    "id": "1778584085227",
    "job": "هيئة معاونة"
  },
  {
    "name": "م. سارة عبده السري",
    "specialization": "عمارة",
    "days": "السبت,الأحد",
    "id": "1778584205461",
    "job": "هيئة معاونة"
  },
  {
    "name": "أ.د. رجب عبد العزيز السحيمي",
    "days": "",
    "specialization": "اتصالات",
    "id": "1778658552828",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "أ.م.د. رمضان عبد العال",
    "specialization": "اتصالات",
    "days": "",
    "id": "1778659471491",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. سالي سعد",
    "specialization": "اتصالات",
    "days": "",
    "id": "1778660273516",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "أ.م.د. أسامة البقساوي",
    "days": "",
    "specialization": "اتصالات",
    "id": "1778660300780",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "أ.د. عبد الرحمن العدل",
    "days": "",
    "specialization": "علوم أساسية",
    "id": "1778660441242",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "أ.م.د. إبراهيم المتولي",
    "days": "",
    "specialization": "اتصالات",
    "id": "1778660651648",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "أ.د. عبد المنعم عبد الباري",
    "specialization": "اتصالات",
    "days": "",
    "id": "1778660768815",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. مجدي فاضل",
    "specialization": "حاسبات",
    "days": "",
    "id": "1778661483954",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. لمياء المنشاوي",
    "days": "",
    "specialization": "حاسبات",
    "id": "1778661668385",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "د. هالة الحديدي",
    "days": "",
    "specialization": "حاسبات",
    "id": "1778661695568",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "أ.د. أسامة محارب",
    "specialization": "علوم أساسية",
    "days": "",
    "id": "1778662910370",
    "job": "عضو هيئة تدريس"
  },
  {
    "name": "ا/آية خليل",
    "specialization": "شؤون إدارية",
    "days": "السبت,الأحد,الإثنين,الثلاثاء,الأربعاء,الخميس",
    "id": "1780211123304",
    "job": "إداري"
  },
  {
    "name": "ا/دعاء خاطر",
    "days": "السبت,الأحد,الإثنين,الثلاثاء,الأربعاء,الخميس",
    "specialization": "شؤون إدارية",
    "id": "1780211136321",
    "job": "إداري"
  },
  {
    "name": "ا/ياسمين الداوودي",
    "days": "السبت,الأحد,الإثنين,الثلاثاء,الأربعاء,الخميس",
    "specialization": "شؤون إدارية",
    "id": "1780211152064",
    "job": "إداري"
  },
  {
    "name": "أ/شروق السري",
    "days": "السبت,الأحد,الإثنين,الثلاثاء,الأربعاء,الخميس",
    "specialization": "شؤون إدارية",
    "id": "1780211170256",
    "job": "إداري"
  },
  {
    "name": "أ/هدير فرح",
    "days": "السبت,الأحد,الإثنين,الثلاثاء,الأربعاء,الخميس",
    "specialization": "شؤون إدارية",
    "id": "1780211189340",
    "job": "إداري"
  },
  {
    "name": "أ/خلود فتحي",
    "specialization": "شؤون إدارية",
    "days": "السبت,الأحد,الإثنين,الثلاثاء,الأربعاء,الخميس",
    "id": "1780211281412",
    "job": "إداري"
  },
  {
    "name": "ا/ أحمد السلاموني",
    "specialization": "شؤون إدارية",
    "days": "",
    "id": "1780738171175",
    "job": "إداري"
  }
] as const;

export const INITIAL_SUBJECTS = [
  {
    "code": "BS 011",
    "year": "إعدادي",
    "name": "رياضيات هندسية (1)",
    "semester": "اول",
    "id": "1776770877340",
    "dept": "قسم العلوم الأساسية",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 012",
    "year": "إعدادي",
    "name": "فيزياء (1)",
    "semester": "اول",
    "id": "1776770890767",
    "dept": "قسم العلوم الأساسية",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 013",
    "year": "إعدادي",
    "name": "ميكانيكا (1)",
    "semester": "اول",
    "dept": "قسم العلوم الأساسية",
    "id": "1776770903030",
    "spec": "علوم أساسية"
  },
  {
    "code": "MEC 014",
    "year": "إعدادي",
    "name": "الرسم الهندسي والإسقاط (1)",
    "semester": "اول",
    "id": "1776770947683",
    "dept": "قسم العلوم الأساسية",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 015",
    "year": "إعدادي",
    "name": "مقدمة الحاسبات والبرمجة",
    "semester": "اول",
    "id": "1776770960707",
    "dept": "قسم العلوم الأساسية",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 016",
    "year": "إعدادي",
    "name": "لغة انجليزية 1",
    "semester": "اول",
    "id": "1776770973715",
    "dept": "قسم العلوم الأساسية",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 021",
    "year": "إعدادي",
    "name": "رياضيات هندسية (2)",
    "semester": "ثاني",
    "dept": "قسم العلوم الأساسية",
    "id": "1776771029861",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 022",
    "year": "إعدادي",
    "name": "فيزياء (2)",
    "semester": "ثاني",
    "id": "1776771041556",
    "dept": "قسم العلوم الأساسية",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 023",
    "year": "إعدادي",
    "name": "ميكانيكا (2)",
    "semester": "ثاني",
    "dept": "قسم العلوم الأساسية",
    "id": "1776771170680",
    "spec": "علوم أساسية"
  },
  {
    "code": "MEC 024",
    "year": "إعدادي",
    "name": "الرسم الهندسي والإسقاط (2)",
    "semester": "ثاني",
    "dept": "قسم العلوم الأساسية",
    "id": "1776771187190",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 025",
    "year": "إعدادي",
    "name": "كيمياء",
    "semester": "ثاني",
    "id": "1776771200313",
    "dept": "قسم العلوم الأساسية",
    "spec": "علوم أساسية"
  },
  {
    "code": "MEC 026",
    "year": "إعدادي",
    "name": "هندسة الإنتاج",
    "semester": "ثاني",
    "id": "1776771218987",
    "dept": "قسم العلوم الأساسية",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 027",
    "year": "إعدادي",
    "name": "الهندسة والبيئة",
    "semester": "ثاني",
    "dept": "قسم العلوم الأساسية",
    "id": "1776771230412",
    "spec": "علوم أساسية"
  },
  {
    "code": "ARE 111",
    "year": "اولى",
    "name": "التصميم المعماري (1)",
    "semester": "اول",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776774144034",
    "spec": "عمارة"
  },
  {
    "code": "ARE 112",
    "year": "اولى",
    "name": "إنشاء معماري (1)",
    "semester": "اول",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776774170506",
    "spec": "عمارة"
  },
  {
    "code": "BS 111",
    "year": "اولى",
    "name": "رياضيات وإحصاء وبرمجة",
    "semester": "اول",
    "id": "1776774188244",
    "dept": "قسم الهندسة المعمارية",
    "spec": "علوم أساسية"
  },
  {
    "code": "ARE 113",
    "year": "اولى",
    "name": "تاريخ ونظريات العمارة (1)",
    "semester": "اول",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776774266833",
    "spec": "عمارة"
  },
  {
    "code": "CIVA 111",
    "year": "اولى",
    "name": "نظرية إنشاءات",
    "semester": "اول",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776774323051",
    "spec": "مدني"
  },
  {
    "code": "CIVA 112",
    "year": "اولى",
    "name": "مساحة هندسية",
    "semester": "اول",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776774396670",
    "spec": "مدني"
  },
  {
    "code": "ARE 121",
    "year": "اولى",
    "name": "التصميم المعماري (2)",
    "semester": "ثاني",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776774703270",
    "spec": "عمارة"
  },
  {
    "code": "ARE 122",
    "year": "اولى",
    "name": "إنشاء معماري (2)",
    "semester": "ثاني",
    "id": "1776774715156",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 123",
    "year": "اولى",
    "name": "تدريب بصري",
    "semester": "ثاني",
    "id": "1776774732011",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 124",
    "year": "اولى",
    "name": "ظل ومنظور",
    "semester": "ثاني",
    "id": "1776774834516",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "CIVA 121",
    "year": "اولى",
    "name": "خواص واختبار مواد",
    "semester": "ثاني",
    "id": "1776774851319",
    "dept": "قسم الهندسة المعمارية",
    "spec": "مدني"
  },
  {
    "code": "ARE 125",
    "year": "اولى",
    "name": "تقارير فنية في العمارة",
    "semester": "ثاني",
    "id": "1776774927006",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 211",
    "year": "ثانية",
    "name": "التصميم المعماري (3)",
    "semester": "اول",
    "id": "1776775025047",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 212",
    "year": "ثانية",
    "name": "تطبيقات حاسب في العمارة (1)",
    "semester": "اول",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776775038302",
    "spec": "عمارة"
  },
  {
    "code": "ARE 213",
    "year": "ثانية",
    "name": "إنشاء معماري (3)",
    "semester": "اول",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776775053843",
    "spec": "عمارة"
  },
  {
    "code": "ARE 214",
    "year": "ثانية",
    "name": "تاريخ ونظريات العمارة (2)",
    "semester": "اول",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776775091888",
    "spec": "عمارة"
  },
  {
    "code": "CIVA 211",
    "year": "ثانية",
    "name": "منشآت خرسانية",
    "semester": "اول",
    "id": "1776775103889",
    "dept": "قسم الهندسة المعمارية",
    "spec": "مدني"
  },
  {
    "code": "ARE 215",
    "year": "ثانية",
    "name": "تاريخ تخطيط المدن",
    "semester": "اول",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776775117752",
    "spec": "عمارة"
  },
  {
    "code": "ARE 221",
    "year": "ثانية",
    "name": "التصميم المعماري (4)",
    "semester": "ثاني",
    "id": "1776775476066",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 222",
    "year": "ثانية",
    "name": "إنشاء معماري (4)",
    "semester": "ثاني",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776775493886",
    "spec": "عمارة"
  },
  {
    "code": "ARE 223",
    "year": "ثانية",
    "name": "تصميم عمراني",
    "semester": "ثاني",
    "id": "1776775538621",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 224",
    "year": "ثانية",
    "name": "طبيعة البناء والتحكم البيئي",
    "semester": "ثاني",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776775597140",
    "spec": "عمارة"
  },
  {
    "code": "ARE 225",
    "year": "ثانية",
    "name": "تطبيقات حاسب في العمارة (2)",
    "semester": "ثاني",
    "id": "1776775679713",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "CIVA 221",
    "year": "ثانية",
    "name": "منشآت معدنية",
    "semester": "ثاني",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776775723217",
    "spec": "مدني"
  },
  {
    "code": "ARE 311",
    "year": "ثالثة",
    "name": "التصميم المعماري (5)",
    "semester": "اول",
    "id": "1776776259046",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 312",
    "year": "ثالثة",
    "name": "تصميمات تنفيذية (1)",
    "semester": "اول",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776776268889",
    "spec": "عمارة"
  },
  {
    "code": "ARE 313",
    "year": "ثالثة",
    "name": "تخطيط وتصميم عمراني",
    "semester": "اول",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776776325283",
    "spec": "عمارة"
  },
  {
    "code": "ARE 314",
    "year": "ثالثة",
    "name": "تاريخ ونظريات العمارة (3)",
    "semester": "اول",
    "id": "1776776400580",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "CIVA 311",
    "year": "ثالثة",
    "name": "أساسات",
    "semester": "اول",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776776424315",
    "spec": "مدني"
  },
  {
    "code": "ARE 311 E",
    "year": "ثالثة",
    "name": "تصميم بيئى",
    "semester": "اول",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776776472345",
    "spec": "عمارة"
  },
  {
    "code": "ARE 312 E",
    "year": "ثالثة",
    "name": "تصميم بالحاسب الآلى",
    "semester": "اول",
    "id": "1776776493997",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 313 E",
    "year": "ثالثة",
    "name": "نظم بناء متقدمة",
    "semester": "اول",
    "id": "1776776516890",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 321",
    "year": "ثالثة",
    "name": "التصميم المعماري (6)",
    "semester": "ثاني",
    "id": "1776776539376",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 322",
    "year": "ثالثة",
    "name": "تصميمات تنفيذية (2)",
    "semester": "ثاني",
    "id": "1776776561186",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 323",
    "year": "ثالثة",
    "name": "تخطيط وتصميم عمراني وإسكان (1)",
    "semester": "ثاني",
    "id": "1776776582402",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "CIVA 321",
    "year": "ثالثة",
    "name": "هندسة صحية",
    "semester": "ثاني",
    "id": "1776776596696",
    "dept": "قسم الهندسة المعمارية",
    "spec": "مدني"
  },
  {
    "code": "ARE 324",
    "year": "ثالثة",
    "name": "التركيبات الفنية بالمباني",
    "semester": "ثاني",
    "id": "1776776610446",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 321 E",
    "year": "ثالثة",
    "name": "تنسيق مواقع",
    "semester": "ثاني",
    "id": "1776776637190",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 322 E",
    "year": "ثالثة",
    "name": "الحفاظ والصيانة للعمران",
    "semester": "ثاني",
    "id": "1776776657296",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 323 E",
    "year": "ثالثة",
    "name": "إدارة مشروعات معمارية",
    "semester": "ثاني",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776776674760",
    "spec": "عمارة"
  },
  {
    "code": "ARE 411",
    "year": "رابعة",
    "name": "تصميمات تنفيذية (3)",
    "semester": "اول",
    "id": "1776928761881",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 412",
    "year": "رابعة",
    "name": "تصميم معماري (7)",
    "semester": "اول",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776928781597",
    "spec": "عمارة"
  },
  {
    "code": "ARE 413",
    "year": "رابعة",
    "name": "تاريخ ونظريات العمارة (4)",
    "semester": "اول",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776928808764",
    "spec": "عمارة"
  },
  {
    "code": "ARE 414",
    "year": "رابعة",
    "name": "التصميم الداخلي",
    "semester": "اول",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776928824851",
    "spec": "عمارة"
  },
  {
    "code": "ARE 415",
    "year": "رابعة",
    "name": "تخطيط عمراني (2)",
    "semester": "اول",
    "id": "1776928873667",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 411 E",
    "year": "رابعة",
    "name": "النقد المعماري والمسابقات",
    "semester": "اول",
    "id": "1776928914623",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 412 E",
    "year": "رابعة",
    "name": "تصميم معماري متقدم",
    "semester": "اول",
    "id": "1776928942688",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 421",
    "year": "رابعة",
    "name": "تصميم عمراني وإسكاني (2)",
    "semester": "ثاني",
    "id": "1776928966114",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 422",
    "year": "رابعة",
    "name": "مواصفات وكميات وضبط جودة",
    "semester": "ثاني",
    "id": "1776928984748",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "ARE 423",
    "year": "رابعة",
    "name": "المشروع",
    "semester": "ثاني",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776929004770",
    "spec": "عمارة"
  },
  {
    "code": "ARE 421 E",
    "year": "رابعة",
    "name": "تخطيط تفصيلى",
    "semester": "ثاني",
    "dept": "قسم الهندسة المعمارية",
    "id": "1776929030454",
    "spec": "عمارة"
  },
  {
    "code": "ARE 422 E",
    "year": "رابعة",
    "name": "التجديد والارتقاء الحضرى",
    "semester": "ثاني",
    "id": "1776929058796",
    "dept": "قسم الهندسة المعمارية",
    "spec": "عمارة"
  },
  {
    "code": "BS 110",
    "year": "اولى",
    "name": "رياضيات هندسية (3)",
    "semester": "اول",
    "id": "1776929242170",
    "dept": "قسم الهندسة المدنية",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 111",
    "year": "اولى",
    "name": "فيزياء (3)",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776929339255",
    "spec": "علوم أساسية"
  },
  {
    "code": "CIV 111",
    "year": "اولى",
    "name": "رسم هندسي مدني",
    "semester": "اول",
    "id": "1776929365574",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 112",
    "year": "اولى",
    "name": "نظرية انشاءات (1)",
    "semester": "اول",
    "id": "1776929400109",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 113",
    "year": "اولى",
    "name": "مساحة مستوية",
    "semester": "اول",
    "id": "1776929413671",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "BS 100",
    "year": "اولى",
    "name": "لغة انجليزية للمهندسين (2)",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776929439632",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 120",
    "year": "اولى",
    "name": "رياضيات هندسية (4)",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1776929530401",
    "spec": "علوم أساسية"
  },
  {
    "code": "CIV 121",
    "year": "اولى",
    "name": "ميكانيكا الموائع",
    "semester": "ثاني",
    "id": "1776929550662",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 122",
    "year": "اولى",
    "name": "خواص ومقاومة المواد (1)",
    "semester": "ثاني",
    "id": "1776929564139",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 123",
    "year": "اولى",
    "name": "ميكانيكا الجوامد",
    "semester": "ثاني",
    "id": "1776929575117",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 124",
    "year": "اولى",
    "name": "نظرية إنشاءات (2)",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1776929594019",
    "spec": "مدني"
  },
  {
    "code": "CIV 125",
    "year": "اولى",
    "name": "مساحة طبواغرافية وجيوديسية",
    "semester": "ثاني",
    "id": "1776929611428",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 211",
    "year": "ثانية",
    "name": "خواص ومقاومة المواد (2)",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776929725788",
    "spec": "مدني"
  },
  {
    "code": "CIV 212",
    "year": "ثانية",
    "name": "نظرية إنشاءات (3)",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776929743987",
    "spec": "مدني"
  },
  {
    "code": "CIV 213",
    "year": "ثانية",
    "name": "الهيدرولوجيا ونظم الري والصرف",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776929774108",
    "spec": "مدني"
  },
  {
    "code": "CIV 214",
    "year": "ثانية",
    "name": "طرق حسابية في الهندسة المدنية",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776929798803",
    "spec": "مدني"
  },
  {
    "code": "CIV 215",
    "year": "ثانية",
    "name": "نظرية المرونة",
    "semester": "اول",
    "id": "1776929820516",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 216",
    "year": "ثانية",
    "name": "جيولوجيا هندسية",
    "semester": "اول",
    "id": "1776929845986",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 221",
    "year": "ثانية",
    "name": "المنشآت المائية",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1776929868666",
    "spec": "مدني"
  },
  {
    "code": "CIV 222",
    "year": "ثانية",
    "name": "تصميم المنشآت المعدنية (1)",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1776929890143",
    "spec": "مدني"
  },
  {
    "code": "CIV 223",
    "year": "ثانية",
    "name": "ميكانيكا التربة والأساسات (1)",
    "semester": "ثاني",
    "id": "1776929907562",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 224",
    "year": "ثانية",
    "name": "خرسانة مسلحة (1)",
    "semester": "ثاني",
    "id": "1776929935804",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 225",
    "year": "ثانية",
    "name": "أساسيات أعمال التشييد والبناء",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1776929956141",
    "spec": "مدني"
  },
  {
    "code": "CIV 311",
    "year": "ثالثة",
    "name": "تقييم المشروعات الهندسية",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776931597574",
    "spec": "مدني"
  },
  {
    "code": "CIV 312",
    "year": "ثالثة",
    "name": "خرسانة مسلحة (2)",
    "semester": "اول",
    "id": "1776931612239",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 313",
    "year": "ثالثة",
    "name": "هندسة التشييد والبناء",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776931626943",
    "spec": "مدني"
  },
  {
    "code": "CIV 314",
    "year": "ثالثة",
    "name": "الهيدروليكا الهندسية",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776931734966",
    "spec": "مدني"
  },
  {
    "code": "CIV 315",
    "year": "ثالثة",
    "name": "ميكانيكا التربة والأساسات (2)",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776931758563",
    "spec": "مدني"
  },
  {
    "code": "C1V 311 E",
    "year": "ثالثة",
    "name": "هندسة العمران",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776931797802",
    "spec": "مدني"
  },
  {
    "code": "CIV 312 E",
    "year": "ثالثة",
    "name": "تجهيز الموقع",
    "semester": "اول",
    "id": "1776931814265",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 313 E",
    "year": "ثالثة",
    "name": "هندسة الأمان في المبانى",
    "semester": "اول",
    "id": "1776931847595",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "MEC 311 E",
    "year": "ثالثة",
    "name": "الطاقة الشمسية في تصميم المبانى",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776931929629",
    "spec": "اتصالات"
  },
  {
    "code": "CIV 314 E",
    "year": "ثالثة",
    "name": "الأنفاق والحفر النفقى",
    "semester": "اول",
    "id": "1776931948528",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 315 E",
    "year": "ثالثة",
    "name": "هندسة السكة الحديدية",
    "semester": "اول",
    "id": "1776931964841",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 321",
    "year": "ثالثة",
    "name": "تقدير التكلفة والعطاءات للمنشآت",
    "semester": "ثاني",
    "id": "1776932020367",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 322",
    "year": "ثالثة",
    "name": "طرق الاحتمالات في هندسة الإنشاءات",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1776932035941",
    "spec": "مدني"
  },
  {
    "code": "CIV 323",
    "year": "ثالثة",
    "name": "التشريعات والمواصفات وقوانين المباني والإسكان",
    "semester": "ثاني",
    "id": "1776932084208",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 324",
    "year": "ثالثة",
    "name": "تصميم المنشآت المعدنية (2)",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1776932114180",
    "spec": "مدني"
  },
  {
    "code": "CIV 325",
    "year": "ثالثة",
    "name": "خرسانة مسلحة (3)",
    "semester": "ثاني",
    "id": "1776932420610",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 326",
    "year": "ثالثة",
    "name": "إدارة مشروعات التشييد (1)",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1776932437052",
    "spec": "مدني"
  },
  {
    "code": "CIV 321 E",
    "year": "ثالثة",
    "name": "شبكات الحاسب في المبانى",
    "semester": "ثاني",
    "id": "1776932470706",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 322 E",
    "year": "ثالثة",
    "name": "وثوقية المنشآت",
    "semester": "ثاني",
    "id": "1776932499645",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "MEC 321 E",
    "year": "ثالثة",
    "name": "أنظمة تكييف الهواء في المبانى",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1776932526098",
    "spec": "اتصالات"
  },
  {
    "code": "ARC 321",
    "year": "ثالثة",
    "name": "نظم الإضاءة في المبانى",
    "semester": "ثاني",
    "id": "1776932643921",
    "dept": "قسم الهندسة المدنية",
    "spec": "عمارة"
  },
  {
    "code": "CIV 323 E",
    "year": "ثالثة",
    "name": "عقود التشييد",
    "semester": "ثاني",
    "id": "1776932678709",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 411",
    "year": "رابعة",
    "name": "هندسة صحية و بيئية",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776932733965",
    "spec": "مدني"
  },
  {
    "code": "CIV 412",
    "year": "رابعة",
    "name": "إدارة مشروعات التشييد (2)",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776933193180",
    "spec": "مدني"
  },
  {
    "code": "CIV 413",
    "year": "رابعة",
    "name": "تخطيط صيانة وحماية المنشآت",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776933207509",
    "spec": "مدني"
  },
  {
    "code": "CIV 423",
    "year": "رابعة",
    "name": "هندسة الموانئ",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776933262726",
    "spec": "مدني"
  },
  {
    "code": "CIV 415",
    "year": "رابعة",
    "name": "مشروع (1)",
    "semester": "اول",
    "id": "1776933294266",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 411 E",
    "year": "رابعة",
    "name": "هندسة الأنهار",
    "semester": "اول",
    "id": "1776933318507",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 411 E",
    "year": "رابعة",
    "name": "الهياكل الخرسانية سابقة الإجهاد",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776933351157",
    "spec": "مدني"
  },
  {
    "code": "CIV 413 E",
    "year": "رابعة",
    "name": "هندسة الكبارى",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776933367892",
    "spec": "مدني"
  },
  {
    "code": "CIV 414 E",
    "year": "رابعة",
    "name": "المساحة التصويرية والاستشعار عن بعد",
    "semester": "اول",
    "id": "1776933387201",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 415 E",
    "year": "رابعة",
    "name": "مواد الإنشاء الحديثة",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776933405577",
    "spec": "مدني"
  },
  {
    "code": "CIV 416 E",
    "year": "رابعة",
    "name": "هندسة الأساسات",
    "semester": "اول",
    "id": "1776933429385",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 417 E",
    "year": "رابعة",
    "name": "تصميم المنصات البحرية",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776933460250",
    "spec": "مدني"
  },
  {
    "code": "CIV 418 E",
    "year": "رابعة",
    "name": "تصميم أعمال الرصف",
    "semester": "اول",
    "dept": "قسم الهندسة المدنية",
    "id": "1776933482768",
    "spec": "مدني"
  },
  {
    "code": "CIV 421",
    "year": "رابعة",
    "name": "إدارة التمويل لمشروعات التشييد",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1776933520089",
    "spec": "مدني"
  },
  {
    "code": "ELC 421",
    "year": "رابعة",
    "name": "الأحمال الكهربية والحرارية للمباني",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1776933538270",
    "spec": "اتصالات"
  },
  {
    "code": "CIV 422",
    "year": "رابعة",
    "name": "هندسة النقل والتخطيط",
    "semester": "ثاني",
    "id": "1776933549386",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 424",
    "year": "رابعة",
    "name": "هندسة السواحل",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1776933565489",
    "spec": "مدني"
  },
  {
    "code": "CIV 425",
    "year": "رابعة",
    "name": "مشروع (2)",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1776933596154",
    "spec": "مدني"
  },
  {
    "code": "CIV 421 E",
    "year": "رابعة",
    "name": "تصميم مباني الطوب",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1776933629467",
    "spec": "مدني"
  },
  {
    "code": "CIV 422 E",
    "year": "رابعة",
    "name": "تصميم المنشآت القشرية",
    "semester": "ثاني",
    "id": "1776933645844",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 423 E",
    "year": "رابعة",
    "name": "تصميم المنشآت الخرسانية المسلحة",
    "semester": "ثاني",
    "id": "1776933666642",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 424 E",
    "year": "رابعة",
    "name": "هندسة النقل البرى",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1776933681485",
    "spec": "مدني"
  },
  {
    "code": "CIV 425 E",
    "year": "رابعة",
    "name": "المعايير المهنية في التصميم والكود المصري في الانشاءات",
    "semester": "ثاني",
    "id": "1776933724670",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "CIV 426 E",
    "year": "رابعة",
    "name": "منشآت مركبة وملجمة",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1776933740183",
    "spec": "مدني"
  },
  {
    "code": "CIV 427 E",
    "year": "رابعة",
    "name": "هندسة الطرق والمطارات",
    "semester": "ثاني",
    "id": "1776933758103",
    "dept": "قسم الهندسة المدنية",
    "spec": "مدني"
  },
  {
    "code": "BS 110",
    "year": "اولى",
    "name": "رياضيات هندسية (3)",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية",
    "id": "1776936448786",
    "spec": "علوم أساسية"
  },
  {
    "code": "COM 111",
    "year": "اولى",
    "name": "أسس الهندسة الكهربية",
    "semester": "اول",
    "id": "1776936669179",
    "dept": "قسم الهندسة الإلكترونية",
    "spec": "اتصالات"
  },
  {
    "code": "COE 112",
    "year": "اولى",
    "name": "برمجة الحاسبات",
    "semester": "اول",
    "id": "1776936681370",
    "dept": "قسم الهندسة الإلكترونية",
    "spec": "حاسبات"
  },
  {
    "code": "BS 111",
    "year": "اولى",
    "name": "فيزياء 3",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية",
    "id": "1776936827871",
    "spec": "علوم أساسية"
  },
  {
    "code": "COM 113",
    "year": "اولى",
    "name": "أسس الهندسة الالكترونية",
    "semester": "اول",
    "id": "1776936897211",
    "dept": "قسم الهندسة الإلكترونية",
    "spec": "اتصالات"
  },
  {
    "code": "BS 100",
    "year": "اولى",
    "name": "لغة انجليزية للمهندسين (2)",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية",
    "id": "1776936965818",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 120",
    "year": "اولى",
    "name": "رياضيات هندسية (4)",
    "semester": "ثاني",
    "id": "1776937061585",
    "dept": "قسم الهندسة الإلكترونية",
    "spec": "علوم أساسية"
  },
  {
    "code": "COM 121",
    "year": "اولى",
    "name": "هندسة الالكترونيات",
    "semester": "ثاني",
    "id": "1776937448697",
    "dept": "قسم الهندسة الإلكترونية",
    "spec": "اتصالات"
  },
  {
    "code": "MEC 121",
    "year": "اولى",
    "name": "ديناميكا حرارية وانتقال حرارة",
    "semester": "ثاني",
    "id": "1776937478196",
    "dept": "قسم الهندسة الإلكترونية",
    "spec": "اتصالات"
  },
  {
    "code": "COM 122",
    "year": "اولى",
    "name": "اختبارات الكترونية (1)",
    "semester": "ثاني",
    "id": "1776937515573",
    "dept": "قسم الهندسة الإلكترونية",
    "spec": "اتصالات"
  },
  {
    "code": "COM 123",
    "year": "اولى",
    "name": "قياسات الكترونية",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية",
    "id": "1776937541009",
    "spec": "اتصالات"
  },
  {
    "code": "BS 210",
    "year": "ثانية",
    "name": "رياضيات هندسية (5)",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية",
    "id": "1776938463754",
    "spec": "علوم أساسية"
  },
  {
    "code": "COM 211",
    "year": "ثانية",
    "name": "تصميم دوائر كهربية",
    "semester": "اول",
    "id": "1776938521612",
    "dept": "قسم الهندسة الإلكترونية",
    "spec": "اتصالات"
  },
  {
    "code": "COM 212",
    "year": "ثانية",
    "name": "مجالات كهرومغناطيسية",
    "semester": "اول",
    "id": "1776938566159",
    "dept": "قسم الهندسة الإلكترونية",
    "spec": "اتصالات"
  },
  {
    "code": "COE 213",
    "year": "ثانية",
    "name": "البرمجة الشيئية",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية",
    "id": "1776938769072",
    "spec": "حاسبات"
  },
  {
    "code": "COM 214",
    "year": "ثانية",
    "name": "تصميم الدوائر المنطقية والرقمية",
    "semester": "اول",
    "id": "1776938850602",
    "dept": "قسم الهندسة الإلكترونية",
    "spec": "اتصالات"
  },
  {
    "code": "BS 220",
    "year": "ثانية",
    "name": "رياضيات هندسية (6)",
    "semester": "ثاني",
    "id": "1776938888117",
    "dept": "قسم الهندسة الإلكترونية",
    "spec": "علوم أساسية"
  },
  {
    "code": "COM 221",
    "year": "ثانية",
    "name": "تصميم الدوائر الإلكترونية",
    "semester": "ثاني",
    "id": "1776939429850",
    "dept": "قسم الهندسة الإلكترونية",
    "spec": "اتصالات"
  },
  {
    "code": "COE 222",
    "year": "ثانية",
    "name": "تطبيقات الحاسب في الهندسة الالكترونية",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية",
    "id": "1776939457980",
    "spec": "حاسبات"
  },
  {
    "code": "COM 223",
    "year": "ثانية",
    "name": "اختبارات الكترونية (2)",
    "semester": "ثاني",
    "id": "1776939510912",
    "dept": "قسم الهندسة الإلكترونية",
    "spec": "اتصالات"
  },
  {
    "code": "COM 224",
    "year": "ثانية",
    "name": "آلات كهربية",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية",
    "id": "1776939816129",
    "spec": "اتصالات"
  },
  {
    "code": "BS 200",
    "year": "ثانية",
    "name": "لغة انجليزية للمهندسين (3)",
    "semester": "ثاني",
    "id": "1776939880145",
    "dept": "قسم الهندسة الإلكترونية",
    "spec": "علوم أساسية"
  },
  {
    "code": "COE 311",
    "year": "ثالثة",
    "name": "بنية الحاسبات (1)",
    "semester": "اول",
    "id": "1776939977877",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 312",
    "year": "ثالثة",
    "name": "هياكل البيانات والخوارزميات",
    "semester": "اول",
    "id": "1776939994989",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 313",
    "year": "ثالثة",
    "name": "هندسة التحكم",
    "semester": "اول",
    "id": "1776940024703",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 314",
    "year": "ثالثة",
    "name": "نظم التشغيل",
    "semester": "اول",
    "id": "1776940039468",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "BS 300",
    "year": "ثالثة",
    "name": "كتابة فنية باللغة الانجليزية",
    "semester": "اول",
    "id": "1776940055809",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "علوم أساسية"
  },
  {
    "code": "COE 311 E",
    "year": "ثالثة",
    "name": "بنية الحاسبات (3)",
    "semester": "اول",
    "id": "1776940091403",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 312 E",
    "year": "ثالثة",
    "name": "حسب 3البرمجة للذكاء الاصطناعي12 ت",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776940135975",
    "spec": "حاسبات"
  },
  {
    "code": "COE 313 E",
    "year": "ثالثة",
    "name": "الرسم بالحاسب",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776940149939",
    "spec": "حاسبات"
  },
  {
    "code": "COE 314 E",
    "year": "ثالثة",
    "name": "الوحدات الطرفية للحاسب",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776940166716",
    "spec": "حاسبات"
  },
  {
    "code": "COE 315 E",
    "year": "ثالثة",
    "name": "نظم البرمجة الشيئية المتقدمة",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776940185071",
    "spec": "حاسبات"
  },
  {
    "code": "COE 316 E",
    "year": "ثالثة",
    "name": "إدارة نظم التشغيل UNIX",
    "semester": "اول",
    "id": "1776940358346",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 317 E",
    "year": "ثالثة",
    "name": "مقدمة في المعلوماتية الحيوية",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776940373968",
    "spec": "حاسبات"
  },
  {
    "code": "COE 321",
    "year": "ثالثة",
    "name": "قواعد البيانات",
    "semester": "ثاني",
    "id": "1776940730821",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 322",
    "year": "ثالثة",
    "name": "بنية الحاسبات (2)",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776940746629",
    "spec": "حاسبات"
  },
  {
    "code": "COE 323",
    "year": "ثالثة",
    "name": "المعالجات الدقيقة ولغة التجميع",
    "semester": "ثاني",
    "id": "1776940761444",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 324",
    "year": "ثالثة",
    "name": "شبكات الحاسب (1)",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776940779338",
    "spec": "حاسبات"
  },
  {
    "code": "COE 321 E",
    "year": "ثالثة",
    "name": "تحليل ومعالجة الإشارات الرقمية",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776940800347",
    "spec": "حاسبات"
  },
  {
    "code": "COE 322 E",
    "year": "ثالثة",
    "name": "تطوير الوسائط المتعددة",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776940816860",
    "spec": "حاسبات"
  },
  {
    "code": "COE 323 E",
    "year": "ثالثة",
    "name": "تصميم المواقع على الانترنت",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776940892916",
    "spec": "حاسبات"
  },
  {
    "code": "COE 324 E",
    "year": "ثالثة",
    "name": "نظم المعلومات الجغرافية",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776940916001",
    "spec": "حاسبات"
  },
  {
    "code": "COE 325 E",
    "year": "ثالثة",
    "name": "النظم المدمجة",
    "semester": "ثاني",
    "id": "1776940930637",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 326 E",
    "year": "ثالثة",
    "name": "نظم الوحدات المنطقية المبرمجة",
    "semester": "ثاني",
    "id": "1776940947993",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 327 E",
    "year": "ثالثة",
    "name": "تصميم دوائر الموائمة مع الحاسبات",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776940970436",
    "spec": "حاسبات"
  },
  {
    "code": "COE 411",
    "year": "رابعة",
    "name": "تحليل وتصميم نظم المعلومات",
    "semester": "اول",
    "id": "1776940997759",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 412",
    "year": "رابعة",
    "name": "امن الحاسبات وسياسات المعلومات (1)",
    "semester": "اول",
    "id": "1776941032362",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 413",
    "year": "رابعة",
    "name": "تصميم قواعد البيانات الموزعة",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776941048768",
    "spec": "حاسبات"
  },
  {
    "code": "COE 414",
    "year": "رابعة",
    "name": "تطوير مواقع الانترنت الديناميكية",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776941064334",
    "spec": "حاسبات"
  },
  {
    "code": "COE 424",
    "year": "رابعة",
    "name": "مشروع (1)",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776941127679",
    "spec": "حاسبات"
  },
  {
    "code": "COE 411 E",
    "year": "رابعة",
    "name": "نظم التحكم بالحاسبات",
    "semester": "اول",
    "id": "1776942762730",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 412 E",
    "year": "رابعة",
    "name": "نظم معالجة الصوت والصورة",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776942781308",
    "spec": "حاسبات"
  },
  {
    "code": "COE 413 E",
    "year": "رابعة",
    "name": "الرؤية بالحاسب",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776942812290",
    "spec": "حاسبات"
  },
  {
    "code": "COE 414 E",
    "year": "رابعة",
    "name": "الحاسبات الموزعة والمتوازية",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776942834980",
    "spec": "حاسبات"
  },
  {
    "code": "COE 415 E",
    "year": "رابعة",
    "name": "هندسة البرمجات",
    "semester": "اول",
    "id": "1776942848385",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 416 E",
    "year": "رابعة",
    "name": "الشبكات العصبية والتحكم المنطقي المبهم",
    "semester": "اول",
    "id": "1776942866922",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 417 E",
    "year": "رابعة",
    "name": "الأرجونوميا (الحاسب والإنسان)",
    "semester": "اول",
    "id": "1776942885942",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 418 E",
    "year": "رابعة",
    "name": "نظم امن وحماية شبكات المعلومات",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776942933848",
    "spec": "حاسبات"
  },
  {
    "code": "COE 421",
    "year": "رابعة",
    "name": "مترجمات البرامج",
    "semester": "ثاني",
    "id": "1776942966275",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 422",
    "year": "رابعة",
    "name": "إدارة وبرمجة الشبكات",
    "semester": "ثاني",
    "id": "1776942980134",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 423",
    "year": "رابعة",
    "name": "امن الحاسبات وسياسات المعلومات (2)",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776942988652",
    "spec": "حاسبات"
  },
  {
    "code": "MEC 424",
    "year": "رابعة",
    "name": "هندسة صناعية",
    "semester": "ثاني",
    "id": "1776943026183",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "اتصالات"
  },
  {
    "code": "COE 424",
    "year": "رابعة",
    "name": "مشروع (2)",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776943097889",
    "spec": "حاسبات"
  },
  {
    "code": "COE 421 E",
    "year": "رابعة",
    "name": "شبكات الحاسب (2)",
    "semester": "ثاني",
    "id": "1776943124084",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 422 E",
    "year": "رابعة",
    "name": "النظم الخبيرة",
    "semester": "ثاني",
    "id": "1776943138668",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 423 E",
    "year": "رابعة",
    "name": "لغات برمجة متقدمة",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776943153162",
    "spec": "حاسبات"
  },
  {
    "code": "COE 424 E",
    "year": "رابعة",
    "name": "موضوعات مختارة في هندسة الحاسب",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776943174024",
    "spec": "حاسبات"
  },
  {
    "code": "COE 425 E",
    "year": "رابعة",
    "name": "محاكاة النظم الهندسية",
    "semester": "ثاني",
    "id": "1776943200491",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 426 E",
    "year": "رابعة",
    "name": "هندسة الجينات",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "id": "1776943238602",
    "spec": "حاسبات"
  },
  {
    "code": "COE 427 E",
    "year": "رابعة",
    "name": "نظم الروبوت",
    "semester": "ثاني",
    "id": "1776943255710",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 428 E",
    "year": "رابعة",
    "name": "نظم دعم واتخاذ القرار",
    "semester": "ثاني",
    "id": "1776943285641",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 429 E",
    "year": "رابعة",
    "name": "تطوير مواقع متقدمة",
    "semester": "ثاني",
    "id": "1776943302436",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "حاسبات"
  },
  {
    "code": "COM 311",
    "year": "ثالثة",
    "name": "نظرية اتصالات (1)",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776972929283",
    "spec": "اتصالات"
  },
  {
    "code": "COM 312",
    "year": "ثالثة",
    "name": "الموجات الكهرومغناطيسية",
    "semester": "اول",
    "id": "1776972943603",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "اتصالات"
  },
  {
    "code": "COM 313",
    "year": "ثالثة",
    "name": "الكترونيات (2)",
    "semester": "اول",
    "id": "1776972955175",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "اتصالات"
  },
  {
    "code": "COE 313",
    "year": "ثالثة",
    "name": "هندسة التحكم",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776972987936",
    "spec": "حاسبات"
  },
  {
    "code": "BS 300",
    "year": "ثالثة",
    "name": "تقارير فنية باللغة الانجليزية",
    "semester": "اول",
    "id": "1776973038608",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "علوم أساسية"
  },
  {
    "code": "COE 311",
    "year": "ثالثة",
    "name": "بنية الحاسبات (1)",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973070132",
    "spec": "حاسبات"
  },
  {
    "code": "COM 311 E",
    "year": "ثالثة",
    "name": "هندسة الصوتيات وفوق السمعيات",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973098686",
    "spec": "اتصالات"
  },
  {
    "code": "COM 312 E",
    "year": "ثالثة",
    "name": "تصميم دوائر الحاسب",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973114919",
    "spec": "اتصالات"
  },
  {
    "code": "COM 313 E",
    "year": "ثالثة",
    "name": "الكترونيات بصرية",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973132360",
    "spec": "اتصالات"
  },
  {
    "code": "COM 314 E",
    "year": "ثالثة",
    "name": "تصميم الدوائر المتكاملة عالية الكثافة VLSI",
    "semester": "اول",
    "id": "1776973179021",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "اتصالات"
  },
  {
    "code": "COM 315 E",
    "year": "ثالثة",
    "name": "نظم الاتصالات الحديثة",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973196709",
    "spec": "اتصالات"
  },
  {
    "code": "COE 312",
    "year": "ثالثة",
    "name": "هياكل البيانات والخوارزميات",
    "semester": "اول",
    "id": "1776973239640",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "حاسبات"
  },
  {
    "code": "COM 321",
    "year": "ثالثة",
    "name": "نظرية اتصالات (2)",
    "semester": "ثاني",
    "id": "1776973267922",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "اتصالات"
  },
  {
    "code": "COM 322",
    "year": "ثالثة",
    "name": "اختبارات الكترونية (3)",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973282905",
    "spec": "اتصالات"
  },
  {
    "code": "COM 323",
    "year": "ثالثة",
    "name": "معالجة إشارات رقمية",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973295010",
    "spec": "اتصالات"
  },
  {
    "code": "COM 321 E",
    "year": "ثالثة",
    "name": "تصميم وتنفيذ الدوائر المطبوعة",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973331610",
    "spec": "اتصالات"
  },
  {
    "code": "COM 322 E",
    "year": "ثالثة",
    "name": "نظم الاتصالات المحمولة",
    "semester": "ثاني",
    "id": "1776973356880",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "اتصالات"
  },
  {
    "code": "COM 323 E",
    "year": "ثالثة",
    "name": "الألياف الضوئية",
    "semester": "ثاني",
    "id": "1776973375731",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "اتصالات"
  },
  {
    "code": "COM 324 E",
    "year": "ثالثة",
    "name": "الكترونيات القوى الكهربائية",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973398898",
    "spec": "اتصالات"
  },
  {
    "code": "COM 411",
    "year": "رابعة",
    "name": "نظرية اتصالات (3)",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973453513",
    "spec": "اتصالات"
  },
  {
    "code": "COM 412",
    "year": "رابعة",
    "name": "الكترونيات (3)",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973473710",
    "spec": "اتصالات"
  },
  {
    "code": "COM 413",
    "year": "رابعة",
    "name": "الهوائيات وانتشار الموجات",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973485070",
    "spec": "اتصالات"
  },
  {
    "code": "COM 424",
    "year": "رابعة",
    "name": "مشروع (1)",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973509515",
    "spec": "اتصالات"
  },
  {
    "code": "COM 411 E",
    "year": "رابعة",
    "name": "نظم الإذاعة والفيديو كونفرانس",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973539156",
    "spec": "اتصالات"
  },
  {
    "code": "COM 412 E",
    "year": "رابعة",
    "name": "أنظمة التحكم الرقمي",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973560989",
    "spec": "اتصالات"
  },
  {
    "code": "COE 322",
    "year": "ثالثة",
    "name": "بنية الحاسبات (2)",
    "semester": "ثاني",
    "id": "1776973625951",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 416 E",
    "year": "رابعة",
    "name": "الشبكات العصبية والتحكم المنطقي المبهم",
    "semester": "اول",
    "id": "1776973705419",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "حاسبات"
  },
  {
    "code": "COE 314 E",
    "year": "رابعة",
    "name": "الوحدات الطرفية للحاسب",
    "semester": "اول",
    "id": "1776973749925",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "حاسبات"
  },
  {
    "code": "COM 413 E",
    "year": "رابعة",
    "name": "موضوعات مختارة في هندسة الاتصالات",
    "semester": "اول",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973767760",
    "spec": "اتصالات"
  },
  {
    "code": "COM 421",
    "year": "رابعة",
    "name": "نظرية اتصالات (4)",
    "semester": "ثاني",
    "id": "1776973810566",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "اتصالات"
  },
  {
    "code": "COM 422",
    "year": "رابعة",
    "name": "الكترونيات صناعية",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973823297",
    "spec": "اتصالات"
  },
  {
    "code": "COM 423",
    "year": "رابعة",
    "name": "اختبارات الكترونية (4)",
    "semester": "ثاني",
    "id": "1776973837137",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "اتصالات"
  },
  {
    "code": "MEC 424",
    "year": "رابعة",
    "name": "هندسة صناعية",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973872405",
    "spec": "اتصالات"
  },
  {
    "code": "COM 424",
    "year": "رابعة",
    "name": "مشروع (2)",
    "semester": "ثاني",
    "id": "1776973888772",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "اتصالات"
  },
  {
    "code": "COM 421 E",
    "year": "رابعة",
    "name": "نظم الأقمار الصناعية",
    "semester": "ثاني",
    "id": "1776973918641",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "اتصالات"
  },
  {
    "code": "COM 422 E",
    "year": "رابعة",
    "name": "أنظمة السنترالات و التليفونات",
    "semester": "ثاني",
    "id": "1776973939003",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "اتصالات"
  },
  {
    "code": "COM 423 E",
    "year": "رابعة",
    "name": "تشخيص أعطال الأنظمة الرقمية",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973965514",
    "spec": "اتصالات"
  },
  {
    "code": "COM 424 E",
    "year": "رابعة",
    "name": "التوجيه والتحكم",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776973980089",
    "spec": "اتصالات"
  },
  {
    "code": "COM 425 E",
    "year": "رابعة",
    "name": "هندسة الموجات الدقيقة",
    "semester": "ثاني",
    "id": "1776973995894",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "اتصالات"
  },
  {
    "code": "COE 327",
    "year": "رابعة",
    "name": "تصميم دوائر الموائمة مع الحاسبات",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776974028562",
    "spec": "حاسبات"
  },
  {
    "code": "COM 426 E",
    "year": "رابعة",
    "name": "معالجة الصور الرقمية",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1776974045651",
    "spec": "اتصالات"
  },
  {
    "code": "COM 427 E",
    "year": "رابعة",
    "name": "موضوعات متقدمة في هندسة الاتصالات",
    "semester": "ثاني",
    "id": "1776974060963",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "spec": "اتصالات"
  },
  {
    "code": "BS 801",
    "year": "إعدادي",
    "name": "مقدمة في علم الاجتماع",
    "semester": "اول",
    "id": "1776974394070",
    "dept": "",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 802",
    "year": "إعدادي",
    "name": "الأخلاق وحقوق الإنسان",
    "semester": "اول",
    "id": "1776974400226",
    "dept": "",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 803",
    "year": "إعدادي",
    "name": "السلوك التنظيمى",
    "semester": "اول",
    "id": "1776974406004",
    "dept": "",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 804",
    "year": "إعدادي",
    "name": "مبادئ الإدارة",
    "semester": "اول",
    "dept": "",
    "id": "1776974414352",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 805",
    "year": "إعدادي",
    "name": "الرقابة على التلوث ومعالجة المخلفات",
    "semester": "اول",
    "dept": "",
    "id": "1776974419924",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 806",
    "year": "إعدادي",
    "name": "الأمن الصناعى",
    "semester": "اول",
    "dept": "",
    "id": "1776974426606",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 807",
    "year": "إعدادي",
    "name": "دراسة جدوى المشروعات",
    "semester": "اول",
    "id": "1776974432502",
    "dept": "",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 808",
    "year": "إعدادي",
    "name": "التحليل الاقتصادى",
    "semester": "اول",
    "dept": "",
    "id": "1776974438065",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 809",
    "year": "إعدادي",
    "name": "هندسة الصيانة",
    "semester": "اول",
    "dept": "",
    "id": "1776974443910",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 810",
    "year": "إعدادي",
    "name": "إدارة الجودة",
    "semester": "اول",
    "dept": "",
    "id": "1776974448534",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 801",
    "year": "إعدادي",
    "name": "مقدمة في علم الاجتماع",
    "semester": "ثاني",
    "id": "1777102328260",
    "dept": "",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 802",
    "year": "إعدادي",
    "name": "الأخلاق وحقوق الإنسان",
    "semester": "ثاني",
    "id": "1777102337923",
    "dept": "",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 803",
    "year": "إعدادي",
    "name": "السلوك التنظيمى",
    "semester": "ثاني",
    "id": "1777102364584",
    "dept": "",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 804",
    "year": "إعدادي",
    "name": "مبادئ الإدارة",
    "semester": "ثاني",
    "dept": "",
    "id": "1777102372343",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 805",
    "year": "إعدادي",
    "name": "الرقابة على التلوث ومعالجة المخلفات",
    "semester": "ثاني",
    "dept": "",
    "id": "1777102388509",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 806",
    "year": "إعدادي",
    "name": "الأمن الصناعى",
    "semester": "ثاني",
    "dept": "",
    "id": "1777102394757",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 807",
    "year": "إعدادي",
    "name": "دراسة جدوى المشروعات",
    "semester": "ثاني",
    "id": "1777102403675",
    "dept": "",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 808",
    "year": "إعدادي",
    "name": "التحليل الاقتصادى",
    "semester": "ثاني",
    "id": "1777102411668",
    "dept": "",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 809",
    "year": "إعدادي",
    "name": "هندسة الصيانة",
    "semester": "ثاني",
    "dept": "",
    "id": "1777102417423",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 810",
    "year": "إعدادي",
    "name": "إدارة الجودة",
    "semester": "ثاني",
    "id": "1777102425575",
    "dept": "",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 806",
    "year": "اولى",
    "name": "الأمن الصناعى",
    "semester": "ثاني",
    "id": "1778659595789",
    "dept": "قسم الهندسة الإلكترونية",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 803",
    "year": "ثالثة",
    "name": "السلوك التنظيمى",
    "semester": "ثاني",
    "dept": "قسم الهندسة الإلكترونية - هندسة الاتصالات",
    "id": "1778661016992",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 803",
    "year": "ثالثة",
    "name": "السلوك التنظيمى",
    "semester": "ثاني",
    "id": "1778661878791",
    "dept": "قسم الهندسة الإلكترونية - هندسة الحاسبات",
    "spec": "علوم أساسية"
  },
  {
    "code": "BS 805",
    "year": "ثانية",
    "name": "الرقابة على التلوث ومعالجة المخلفات",
    "semester": "ثاني",
    "dept": "قسم الهندسة المدنية",
    "id": "1778663028807",
    "spec": "علوم أساسية"
  }
] as const;

export const INITIAL_COMMITTEES = [
  {
    "id": "1777973364585",
    "roomNum": "1",
    "hallName": "صالة رسم 1",
    "floor": "الدور الرابع"
  },
  {
    "id": "1777973389403",
    "roomNum": "2",
    "floor": "الدور الرابع",
    "hallName": "صالة رسم 2"
  },
  {
    "id": "1777973408421",
    "roomNum": "3",
    "hallName": "قاعة عمارة 3",
    "floor": "الدور الخامس"
  },
  {
    "id": "1777973440150",
    "roomNum": "11",
    "floor": "الدور الخامس",
    "hallName": "قاعة عمارة 4"
  },
  {
    "id": "1777973459208",
    "roomNum": "17",
    "floor": "الدور الخامس",
    "hallName": "قاعة عمارة 4"
  },
  {
    "id": "1777973487447",
    "roomNum": "12",
    "hallName": "مدرج 1",
    "floor": "الدور الأول"
  },
  {
    "id": "1777973499035",
    "roomNum": "13",
    "floor": "الدور الأول",
    "hallName": "مدرج 1."
  },
  {
    "id": "1777973766606",
    "roomNum": "5",
    "floor": "الدور الثاني",
    "hallName": "مدرج 2"
  },
  {
    "id": "1777973779313",
    "roomNum": "6",
    "floor": "الدور الثاني",
    "hallName": "مدرج 3"
  },
  {
    "id": "1777973795099",
    "roomNum": "18",
    "floor": "الدور الخامس",
    "hallName": "قاعة عمارة 3"
  },
  {
    "id": "1777973832846",
    "roomNum": "7",
    "hallName": "مدرج 1",
    "floor": "الدور الأول"
  },
  {
    "id": "1777973843171",
    "roomNum": "8",
    "floor": "الدور الأول",
    "hallName": "مدرج 1."
  },
  {
    "id": "1777973879192",
    "roomNum": "4",
    "floor": "الدور الرابع",
    "hallName": "قاعة عمارة 2"
  },
  {
    "id": "1777973895324",
    "roomNum": "20",
    "hallName": "صالة رسم 2",
    "floor": "الدور الرابع"
  },
  {
    "id": "1777973947722",
    "roomNum": "9",
    "hallName": "مدرج 4",
    "floor": "الدور الثالث"
  },
  {
    "id": "1777974038001",
    "roomNum": "21",
    "floor": "الدور الرابع",
    "hallName": "قاعة عمارة 2"
  },
  {
    "id": "1777974158271",
    "roomNum": "10",
    "hallName": "قاعة عمارة 1",
    "floor": "الدور الثالث"
  },
  {
    "id": "1777974182450",
    "roomNum": "14",
    "hallName": "مدرج 2",
    "floor": "الدور الثاني"
  },
  {
    "id": "1777974194108",
    "roomNum": "15",
    "floor": "الدور الثاني",
    "hallName": "مدرج 3"
  },
  {
    "id": "1777974212275",
    "roomNum": "22",
    "floor": "الدور الثالث",
    "hallName": "مدرج 4"
  },
  {
    "id": "1777974232778",
    "roomNum": "19",
    "hallName": "قاعة عمارة 1",
    "floor": "الدور الثالث"
  },
  {
    "id": "1778574081857",
    "roomNum": "16",
    "floor": "الدور الرابع",
    "hallName": "صالة رسم 1"
  },
  {
    "id": "1778575841265",
    "roomNum": "16",
    "hallName": "مدرج 1",
    "floor": "الدور الأول"
  },
  {
    "id": "1779614835927",
    "roomNum": "18",
    "hallName": "معمل الحاسب (2)",
    "floor": "الدور الثالث"
  }
] as const;

export const INITIAL_ACADEMIC_YEARS = [
  "2024 - 2025",
  "2025 - 2026",
  "2026 - 2027"
] as const;

export const INITIAL_SIGNATURES = {
  "sigSystem": "أ.م.د. علي سمير عوض",
  "sigTables": "د. حياه سامي على احمد",
  "sigDean": "أ.د. رجب عبد العزيز السحيمي"
} as const;

export const INITIAL_USERS = [
  {
    "password": "********",
    "perms": "hrs,sch,obs,obsd,sub,com,att,sts",
    "role": "admin",
    "ownerName": "د. حياه سامي على احمد",
    "email": "",
    "username": "hayah"
  },
  {
    "password": "********",
    "perms": "hrs,sch,obs,obsd,sub,com,att,sts",
    "role": "admin",
    "ownerName": "أ.م.د. علي سمير عوض",
    "email": "alisamirawed@gmail.com",
    "username": "alisamir"
  },
  {
    "password": "********",
    "perms": "hrs,sch,obs,obsd,sub,com,att,sts",
    "role": "admin",
    "ownerName": "د. جرجس سيدهم",
    "email": "",
    "username": "gs"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. جيرمين منصور قنديل",
    "email": "",
    "username": "Germen.Kandel"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. أسماء علاء حسانين",
    "email": "",
    "username": "Asmaa.Alaa"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. هويدا على النقيب",
    "email": "",
    "username": "Howyda.Ali"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م.م. دينا محمد رزق",
    "email": "",
    "username": "Dina.Rizk"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. سارة ياسر محمد",
    "email": "",
    "username": "Sara.Yasser"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. رهف إبراهيم الدسوقي",
    "email": "",
    "username": "Rahaf.Ibrahim"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. سمية محمد أبو الغيط",
    "email": "",
    "username": "Somaya.Mohamed"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. أميرة السيد محمد",
    "email": "",
    "username": "Amira.Elsayed"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. سارة مجدي مختار",
    "email": "",
    "username": "Sarah.Magdy"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. أسماء الشرباصى",
    "email": "",
    "username": "Asmaa.Mohamed"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. مادلين محمد الهنداوى",
    "email": "",
    "username": "Madleen.Mohamed"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "د. إيمان عبد النبي أنور",
    "email": "eng.eman.anowr@gmail.com",
    "username": "Eman.Anowr"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م.م. رنا محمد البلقا",
    "email": "",
    "username": "Rana.Mohamed"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. شيماء أحمد محمد",
    "email": "",
    "username": "Shimaa.Ahmed"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م.م. رانا محسن مختار",
    "email": "",
    "username": "Rana.Mohsen"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "د. عفاف البنا",
    "email": "",
    "username": "Afaf.Elbanna"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. غدير طارق البيومي",
    "email": "",
    "username": "Ghadeer.Tarek"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م.م. فاطمة الزهراء المتولى",
    "email": "",
    "username": "Fatma.Elmetwaly"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. خلود عادل حسن",
    "email": "",
    "username": "Kholoud.Adel"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. مريم رضا سابق",
    "email": "",
    "username": "Maryam.Reda"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. هند السيد العربي",
    "email": "",
    "username": "Hend.Elsayed"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. سارة عبده السري",
    "email": "saraabdo8642@gmail.com",
    "username": "Sara.Abdo"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. نورا عاطف الحنفي",
    "email": "",
    "username": "Noura.Atef"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. نورهان طارق كامل",
    "email": "",
    "username": "Nourhan.Tarek"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. اروى أحمد رضا",
    "email": "",
    "username": "Arwa.Ahmed"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. آية إبراهيم حسان",
    "email": "",
    "username": "Aya.Ebrahim"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م.م. أحمد محمد الباز",
    "email": "",
    "username": "Ahmed.Elbaz"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. ندى التميمي موسى",
    "email": "",
    "username": "Nada.Eltamimy"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م.م. مصطفى محمد قشطة",
    "email": "",
    "username": "Mostafa.Keshta"
  },
  {
    "password": "********",
    "perms": "hrs,sts",
    "role": "user",
    "ownerName": "م. أمل ياسر شوقى",
    "email": "",
    "username": "Aml.Yasser"
  },
  {
    "password": "********",
    "perms": "hrs,sch,obs,obsd,sub,com,att,sts,ctrlDash,ctrlWorks",
    "role": "admin",
    "ownerName": "د. أحمد البسيوني",
    "email": "eng.ahmedbasiouny2014@gmail.com",
    "username": "Dr. Ahmed El-Basiouny"
  },
  {
    "password": "********",
    "perms": "ctrlDash",
    "role": "viewer",
    "ownerName": "أ.د. رجب عبد العزيز السحيمي",
    "email": "",
    "username": "Prof.Ragab"
  }
] as const;

export const INITIAL_PERIODS = [
  'الفترة الأولى (9:00 - 11:00)',
  'الفترة الثانية (11:30 - 1:30)',
  'الفترة الثالثة (2:00 - 4:00)',
];

export const INITIAL_DEPARTMENTS = [
  'قسم العلوم الأساسية',
  'قسم الهندسة المعمارية',
  'قسم الهندسة المدنية',
  'قسم الهندسة الكهربية',
];

export const INITIAL_JOB_TITLES = [
  'عضو هيئة تدريس',
  'أستاذ دكتور',
  'أستاذ مساعد',
  'مدرس',
  'مدرس مساعد',
  'معيد',
  'جهاز إداري',
  'فني معمل',
  'أمين سر لجنة',
];

export const INITIAL_CONTROL_STAGES = [
  '1) نموذج ورقة الأسئلة',
  '2) الإجابة النموذجية',
  '3) أعمال السنة',
  '4) محضر الفض',
  '5) تقرير السير',
  '6) محاضر الغش',
  '7) استمارات الغياب',
  '8) تسليم ورق الإجابة للمصحح',
  '9) استلام ورقة الإجابة بعد التصحيح',
  '10) المراجعة الأولى لكراسات الإجابة',
  '11) رصد أعمال السنة',
  '12) رصد العملي',
  '13) رصد التحريري',
  '14) مراجعة الرصد للفرقة',
];
